#echo -e "\033[30m 黑色字 \033[0m”
#echo -e "\033[31m 红色字 \033[0m”
#echo -e "\033[32m 绿色字 \033[0m”
#echo -e "\033[33m 黄色字 \033[0m”
#echo -e "\033[34m 蓝色字 \033[0m”
#echo -e "\033[35m 紫色字 \033[0m”
#echo -e "\033[36m 天蓝字 \033[0m”
#echo -e "\033[37m 白色字 \033[0m”

echo -e "\033[34m*********************************************************\033[0m"
echo -e "\033[32m__    __      ___   _   _    _____   _   _   _____   _       _      \033[0m"
echo -e "\033[32m\ \  / /     /   | | | / /  /  ___/ | | | | | ____| | |     | |     \033[0m"
echo -e "\033[32m \ \/ /     / /| | | |/ /   | |___  | |_| | | |__   | |     | |     \033[0m"
echo -e "\033[32m  \  /     / / | | | |\ \   \___  \ |  _  | |  __|  | |     | |     \033[0m"
echo -e "\033[32m  / /     / /  | | | | \ \   ___| | | | | | | |___  | |___  | |___  \033[0m"
echo -e "\033[32m /_/     /_/   |_| |_|  \_\ /_____/ |_| |_| |_____| |_____| |_____| \033[0m"
echo ""
echo -e "\033[37m Version 0.1\033[0m"
echo -e "\033[37m Author  mason\033[0m"
echo -e "\033[37m Email   mslsoftware@qq.com\033[0m"
echo -e "\033[37m QQ      8672863[0m"
echo -e "\033[34m*********************************************************\033[0m"

echo -e "start install \c"

for((i=1;i<100;i++))
do
	echo -e ".\c"
#	sleep 0.01
done
echo "successed."


echo -e "install progress.............................................. \c"

for((i=1;i<100;i++))
do
	if [ $i -lt 11 ] ; then
                echo -e "\b$i\c"
        elif [ $i -lt 101 ] ; then
                echo -e "\b\b$i\c"
        else
                echo -e "\b\b\b$i\c"
	fi
	sleep 0.01
done
echo "successed."