<?php
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 应用设置
// +----------------------------------------------------------------------

return [
	// 应用名称
	'app_name' => '',
	// 应用地址
	'app_host' => 'www.01film.cn',
	//服务器id，分布式服务器标识id,建议100-999之间
	'app_host_id' => 100,
	'isRoute' => true, //是否开启严格路由，开启后，未经配置路由的地址无法访问
	'routeLen' => 2, //路由位数。参数是2或3，截取path域名2个斜杠进行路由 /chat/index，参数是3路由含模块，2不含模块仅路由控制器和方法
	// 'module' => 'chat', //默认模块名

];
