<?php
// +----------------------------------------------------------------------
// +----------------------------------------------------------------------
// | 日志设置
// +----------------------------------------------------------------------
return [
// 总配置设定

	'default' => [
		'logPath' => '',
		// 日志根目录
		'logFile' => 'default.log', // 日志文件
		'format' => 'Y/m/d', // 日志自定义目录，使用日期时间定义

	],
	'user' => [
		'logPath' => '',
		'logFile' => 'user.log',
		'format' => 'Ym/d',

	],
	'order' => [
		'logPath' => '',
		'logFile' => 'order.log',
		'format' => 'Y/m/d',
	],

];
