<?php

// +----------------------------------------------------------------------
// | 缓存设置
// +----------------------------------------------------------------------

return [
	// 默认redis服务器配置
	'default' => [
		// 'host' => '192.168.0.246',
		'host' => '127.0.0.1',
		'port' => 6379,
		'password' => 'root',
		'select' => 0,
		'timeout' => 0, //连接超时时间
		'expire' => 31536000, //默认存储有效期1年
		'persistent' => false, //是否长连接,关闭脚本连接不释放
		'prefix' => '', //key前缀
		'serialize' => true, //存取前 是否json格式化
	],
	// 备用的redis服务器配置，当主redis服务器故障时候会切换到这来
	'spare' => [
		//'host' => '192.168.0.246',
		'host' => '127.0.0.1',
		'port' => 6379,
		'password' => 'root',
		'select' => 0,
		'timeout' => 0, //连接超时时间
		'expire' => 31536000, //默认存储有效期1年
		'persistent' => false, //是否长连接,关闭脚本连接不释放
		'prefix' => '', //key前缀
		'serialize' => true, //存取前 是否json格式化
	],
];
